backend/controllers/CategoriesController.php

SELECT * FROM `categories` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Categories::findOne($id)) !== null) {