backend/controllers/VendorController.php

    public function actionCreate()
    {
        $model = new Vendor();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

            $subcategories = Yii::$app->request->post('Vendor')['subcategory_id'];
            $categories = Yii::$app->request->post('Vendor')['category_id'];

            foreach($categories as $category)
            {

                $vendorCategory = new VendorCategories();
                $vendorCategory->vendor_id = $model->id;

                $vendorCategory->category_id =   $category;
                $vendorCategory->save();
---
INSERT INTO `vendor` (`date`, `shop_name`, `shop_address`, `shop_image`, `time_from`, `time_to`, `weekly_off`, `shop_owner`, `description`, `mobile`, `opt_mobileno`, `email`, `opt_email`, `map_location`, `collected_by`, `webingeer_coupon`) VALUES ('13-Feb-2009', 'Hamish Lara', 'Consectetur nemo aperiam laboriosam ut sed dignissimos qui odit dolor voluptatem Nisi nostrum cupiditate incididunt quas', '', 'Corporis deleniti sed tempore aspernatur nesciunt aliquid', 'Fuga Numquam nihil ut et id laboriosam quidem porro sunt qui nostrud itaque', 'Saturday', 'Lorem ad rerum debitis qui ut', 'Voluptatem et consequatur? Rerum sapiente eos rem quibusdam provident, quis commodo consequatur do duis eos, dolor.', '32652336', '8732', 'mugakev@hotmail.com', 'fafirizo@hotmail.com', 234.23, 'me', 'Yes')
INSERT INTO `vendor_categories` (`vendor_id`, `category_id`) VALUES ('21', '1')

    protected function findModel($id)
    {
        if (($model = Vendor::findOne($id)) !== null) {
---
SELECT * FROM `vendor` WHERE `id`='21'